#include "ui.h"

 void Ui::start()
{
	system("cls");
	cout << endl;
	cout << "■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■            ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★            ■\n"
			"■            ★  Welcom to CodingOn ★            ■\n"
			"■            ★      with POSCO     ★            ■\n"
			"■            ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★ ★            ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                 < 시작 화면 >                 ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                 1. 로그인                     ■\n"
			"■                                               ■\n"
			"■                 2. 이메일 찾기                ■\n"
			"■                                               ■\n"
			"■                 3. PW 찾기                    ■\n"
			"■                                               ■\n"
			"■                 4. 회원가입                   ■\n"
			"■                                               ■\n"
			"■                 0. 종료                       ■\n"
			"■                                               ■\n"
			"■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n\n";
}

 void Ui::login()
 {
	system("cls");
	cout << endl;
	cout << "■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                < 로그인 화면 >                ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■              >> 이메일 입력                   ■\n"
			"■                                               ■\n"
			"■              >> 비밀번호 입력                 ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■              >> 완료시 로그인                 ■\n"
			"■                                               ■\n"
			"■              >> exit 입력시 종료              ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n\n";
 }

 void Ui::searchEmail()
 {
	system("cls");
	cout << endl;
	cout << "■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                < 이메일 찾기 >                ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■              >> 전화번호 입력                 ■\n"
			"■                                               ■\n"
			"■              >> 생년월일 입력                 ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■              >> 완료시 이메일 출력            ■\n"
			"■                                               ■\n"
			"■              >> exit 입력시 종료              ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n\n";
 }

 void Ui::searchPw()
 {
    system("cls");
	cout << endl;
	cout << "■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                < 비밀번호 찾기 >              ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■              >> 이메일 입력                   ■\n"
			"■                                               ■\n"
			"■              >> 인증번호 받기                 ■\n"
			"■                                               ■\n"
			"■              >> 인증번호 입력                 ■\n"
			"■                                               ■\n"
			"■              >> 새로운 비밀번호 입력          ■\n"
			"■                                               ■\n"
			"■              >> exit 입력시 종료              ■\n"
			"■                                               ■\n"
			"■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n\n";
 }

void Ui::join()
{
    system("cls");
	cout << endl;
	cout << "■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n"
		    "■                                               ■\n"
		    "■                                               ■\n"
		    "■                <  회원 가입  >                ■\n"
		    "■                                               ■\n"
		    "■              >> 이메일 입력                   ■\n"
		    "■                                               ■\n"
		    "■              >> 비밀번호 입력                 ■\n"
		    "■                                               ■\n"
		    "■              >> 전화번호 입력                 ■\n"
		    "■                                               ■\n"
		    "■              >> 생년월일 입력                 ■\n"
		    "■                                               ■\n"
		    "■              >> 인증번호 받기                 ■\n"
		    "■                                               ■\n"
		    "■              >> 인증번호 입력                 ■\n"
		    "■                                               ■\n"
		    "■              >> 인증 성공시                   ■\n"
		    "■                 시작 화면 으로이동            ■\n"
		    "■                                               ■\n"
		    "■              >> exit 입력시 종료              ■\n"
		    "■                                               ■\n"
		    "■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n\n";
}

void Ui::mainMenu()
{
	Sleep(500);
	system("color 06"); 
	system("cls");
	cout << endl;
    cout << "■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■             < 현재 상태 : 접속 중 >           ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■              1. 내 정보                       ■\n"
			"■                                               ■\n"
			"■              2. 대화방                        ■\n"
			"■                                               ■\n"
			"■              3. 설정                          ■\n"
			"■                                               ■\n"
			"■              0. 종료                          ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n\n";
}

void Ui::myMenu()
{
	system("cls");
	cout << endl;
	cout << "■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                < 내 정보 보기 >               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■               1. 내 프로필                    ■\n"
			"■                                               ■\n"
			"■               2. 닉네임 설정/수정             ■\n"
			"■                                               ■\n"
			"■               3. 상메 설정/수정               ■\n"
			"■                                               ■\n"
			"■               4. BGM 설정/수정                ■\n"
			"■                                               ■\n"
			"■               0. 뒤로가기                     ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n\n";
}

void Ui::chatting()
{
	system("cls");
	cout << endl;
	cout << "■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n"
	        "■                                               ■\n"
	        "■                                               ■\n"
	        "■                                               ■\n"
	        "■                                               ■\n"
	        "■                < 채팅 입장/검색 >             ■\n"
	        "■                                               ■\n"
	        "■                                               ■\n"
	        "■              1. 채팅방 입장                   ■\n"
	        "■                                               ■\n"
	        "■              >> /귓말 이름 내용입력           ■\n"
	        "■                                               ■\n"
	        "■              >> /종료 입력시 퇴장             ■\n"
	        "■                                               ■\n"
	        "■              2. 채팅 내용 검색                ■\n"
	        "■                                               ■\n"
	        "■              3. 채팅 기간 검색                ■\n"
	        "■                                               ■\n"
	        "■              0. 뒤로가기                      ■\n"
	        "■                                               ■\n"
	        "■                                               ■\n"
	        "■                                               ■\n"
	        "■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n\n";
}

void Ui::setting()
{
	system("cls");
	cout << endl;
	cout << "■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                < 내 설정 >                    ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■              1. 비밀번호 변경                 ■\n"
			"■                                               ■\n"
			"■              2. 회원 탈퇴                     ■\n"
			"■                                               ■\n"
			"■              0. 뒤로가기                      ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■                                               ■\n"
			"■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n\n";
}

void Ui::pwEx() {
	cout << endl;
	cout << "■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n"
			"■ 1. !@#$%^&*+=-~ 여기에 포함된 특수문자 1개 이상 포함  ■\n"
			"■ 2. 한글을 제외한 8~15자리                             ■\n"
			"■ 3. 대소문자 각각 1개 이상 포함                        ■\n"
			"■ 4. 숫자 1개 이상 포함                                 ■\n"
			"■ ex) @Coding3                                          ■\n"
			"■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n\n";

}

void Ui::emailEx() {
	cout << endl;
	cout << "■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n"
			"■ ex) atta741@naver.com ■\n"
			"■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n\n";
}

void Ui::phoneEx() {
	cout << endl;
    cout << "■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n"
			"■ ex) 01098765432 ■\n"
			"■ ■ ■ ■ ■ ■ ■ ■ ■ ■\n\n";
}

void Ui::birthdayEx() {
	cout << endl;
	cout << "■ ■ ■ ■ ■ ■ ■ ■ ■\n"
			"■ ex) 19890606  ■\n"
			"■ ■ ■ ■ ■ ■ ■ ■ ■\n\n";
}